; domain
(define (domain drone-dom)

    (:requirements
        :typing
    )

    (:types
        drone human box content location - object
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry ?d - drone ?b - box)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
    )

    (:action move
        :parameters (?d - drone ?from ?to - location)
        :precondition (and 
            (drone-at ?d ?from)
        )
        :effect (and
            (drone-at ?d ?to) 
            (not (drone-at ?d ?from))
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r0_l2_p2_c2_g2_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	box1 - box
	box2 - box
	food - content
	meds - content
	human1 - human
	human2 - human
)

(:init
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-has box1 food)
	(box-has box2 meds)
	(human-at human1 loc2)
	(human-at human2 loc1)
)

(:goal (and

	(drone-at drone1 warehouse)
	(human-has human1 food)
	(human-has human2 meds)
	))
)

; plan
1. (pick-up drone1 box2 meds warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry drone1 box2)
   goals met: 1 of 3
2. (move drone1 warehouse loc1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc1)
   goals met: 0 of 3
3. (drop drone1 box2 meds loc1 human2)
   deleted: (drone-carry drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc1) (human-has human2 meds)
   goals met: 1 of 3
4. (move drone1 loc1 warehouse)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 3
5. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry drone1 box1)
   goals met: 2 of 3
6. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 1 of 3
7. (drop drone1 box1 food loc2 human1)
   deleted: (drone-carry drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc2) (human-has human1 food)
   goals met: 2 of 3
8. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 3
